In [90]:
import pandas as pd
import numpy as np

#### Q. 24

In [2]:
# Question No 24 starts here

In [8]:
df = pd.DataFrame({
    'EmpId': [11, 12, 13, 14, 15],
    'EmpSalary': [20000, 21000, np.NaN, 21500, np.NaN]
})

In [9]:
df

   EmpId  EmpSalary
0     11    20000.0
1     12    21000.0
2     13        NaN
3     14    21500.0
4     15        NaN

In [10]:
df.EmpSalary = df.EmpSalary.ffill()

In [11]:
df

   EmpId  EmpSalary
0     11    20000.0
1     12    21000.0
2     13    21000.0
3     14    21500.0
4     15    21500.0

In [12]:
# Question No 24 ends here

#### Q. 25

In [13]:
# Question No 25 starts here

In [14]:
a = [6, 3, 8, 'hi', 76, 'exam']
b = ['First', 65, 78]

In [15]:
result = a + b

In [16]:
result

[6, 3, 8, 'hi', 76, 'exam', 'First', 65, 78]

In [17]:
# Question No 25 ends here

#### Q. 26

In [18]:
# Question No 26 starts here

In [19]:
df = pd.DataFrame({
    'Product': 'A B C D E F'.split(),
    'Quality': [3, 4, 1, 6, 3, 8],
    'Price': [3400, 3244, 5645, 7587, 7858, 4572]
})

In [20]:
df

  Product  Quality  Price
0       A        3   3400
1       B        4   3244
2       C        1   5645
3       D        6   7587
4       E        3   7858
5       F        8   4572

In [21]:
df.Quality = df.Quality.apply(lambda x: 0 if x <= 5 else 1)

In [22]:
df

  Product  Quality  Price
0       A        0   3400
1       B        0   3244
2       C        0   5645
3       D        1   7587
4       E        0   7858
5       F        1   4572

In [23]:
# Question No 26 ends here

#### Q. 27

In [24]:
# Question No 27 starts here

SELECT sd.student_name
FROM TrainingDetail td
JOIN StudentDetail sd USING (student_id)
GROUP BY td.student_id
HAVING COUNT(td.id) > 1
ORDER BY 1

In [25]:
# Question No 27 ends here

#### Q. 28

In [26]:
# Question No 28 starts here

The query mentioned in the question will return only one row,

```
    Id   Name            ReferredBy
    5    Pat Richards    1
```
<hr>

This is because `<>` or `==` operators check for equality between values, the NULL here is not any specific value, instead it's just a placeholder to denote the absense of a value and hence is ignored by the comparision operators.
<hr>

`IS NULL` OR `IS NOT NULL` should be used to handle NULL values. 

The query can be re-written as:

```
    SELECT Name
    FROM Customers
    WHERE ReferredBy <> 2 OR ReferredBy IS NULL;
```

In [27]:
# Question No 28 ends here

#### Q. 29

In [28]:
# Question No 29 starts here

In [29]:
# Question No 29 ends here

#### Q. 30

In [30]:
# Question No 30 starts here

In [31]:
df = pd.DataFrame({
    "Department Name": "D1 D2 D3".split(),
    "Avg. Salary": "50k 10k 120k".split()
})

In [32]:
df

  Department Name Avg. Salary
0              D1         50k
1              D2         10k
2              D3        120k

In [33]:
df.loc[df['Department Name'] == 'D2', 'Avg. Salary'] = '100k'

In [34]:
df

  Department Name Avg. Salary
0              D1         50k
1              D2        100k
2              D3        120k

In [35]:
# Question No 30 starts here

#### Q. 31

In [36]:
# Question No 31 starts here

In [37]:
# Question No 31 ends here

#### Q. 32

In [38]:
# Question No 32 starts here

In [39]:
df = pd.DataFrame({
    "Product": "Banana Carrots Beans Orange Orange Banana Carrots Beans Orange Banana Carrots Beans".split(),
    "Amount": [1000, 1500, 1600, 2000, 2000, 400, 1200, 1500, 4000, 2000, 2000, 2000],
    "Country": ["USA"]*5 + ["China"]*4 + ["Canada"]*2 + ["Mexico"]
})

In [40]:
df

    Product  Amount Country
0    Banana    1000     USA
1   Carrots    1500     USA
2     Beans    1600     USA
3    Orange    2000     USA
4    Orange    2000     USA
5    Banana     400   China
6   Carrots    1200   China
7     Beans    1500   China
8    Orange    4000   China
9    Banana    2000  Canada
10  Carrots    2000  Canada
11    Beans    2000  Mexico

In [41]:
df_pivot = df.pivot_table(values='Amount', index='Product', columns='Country', aggfunc='sum')

In [42]:
df_final = df_pivot.reset_index().rename_axis(None, axis=1)

In [43]:
df_final

   Product  Canada   China  Mexico     USA
0   Banana  2000.0   400.0     NaN  1000.0
1    Beans     NaN  1500.0  2000.0  1600.0
2  Carrots  2000.0  1200.0     NaN  1500.0
3   Orange     NaN  4000.0     NaN  4000.0

In [44]:
# Question No 32 ends here

#### Q. 33

In [45]:
# Question No 33 starts here

In [94]:
import re
import csv


CREDIT_CARD_NUMBER_FILEPATH = '/Users/abhishek.dalvi/Abhishek/credit-card-samples.txt'
OUTPUT_FILEPATH = '/Users/abhishek.dalvi/Abhishek/credit-card-samples-validation.csv'

def _validate_credit_card_number(credit_card_number):
    is_valid = False
    
    # Pattern 1, to validate the following rules:
    #     It must start with a 4,5 or 6.
    #     It must contain exactly digits.
    #     It must only consist of digits (0-9).
    #     It may have digits in groups of 4, separated by one hyphen "-"
    #     It must NOT use any other separator like ' ' , '_', etc.
    base_pattern = r"[456]\d{3}-?\d{4}-?\d{4}-?\d{4}$"
    
    # Pattern 2, to validate the last rule:
    #     It must NOT have 4 or more consecutive repeated digits.
    repeating_char_pattern = r"(\d)\1{3,}"
    
    is_valid = bool(re.match(base_pattern, credit_card_number))
    if is_valid and ('-' in credit_card_number):
        is_valid = not bool(re.findall(repeating_char_pattern, credit_card_number.replace('-', '')))
    return "Valid" if is_valid else "Invalid"

def validate_credit_card_file():
    cc_file = open(CREDIT_CARD_NUMBER_FILEPATH, 'r')
    output_file = open(OUTPUT_FILEPATH, 'w')

    validation_result = []
    for credit_card_number in cc_file.readlines():
        credit_card_number = credit_card_number.strip()
        validation_result.append({
            "Credit Card No": credit_card_number,
            "Results": _validate_credit_card_number(credit_card_number)
        })
    
    writer = csv.DictWriter(output_file, list(validation_result[0].keys()))
    writer.writeheader()
    writer.writerows(validation_result)
    
validate_credit_card_file()